RIOT-OS/RIOT/cpu/cc26xx_cc13xx/vendor/ti/devices/cc13x0/inc/hw_fcfg1.h
// Field: [19:16] VHV_PV
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_PV_VHV_PV_W                                          4
#define FCFG1_FLASH_VHV_PV_VHV_PV_M                                 0x000F0000
#define FCFG1_FLASH_VHV_PV_VHV_PV_S                                         16

// Field:  [15:8] VCG2P5
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_PV_VCG2P5_W                                          8
#define FCFG1_FLASH_VHV_PV_VCG2P5_M                                 0x0000FF00
#define FCFG1_FLASH_VHV_PV_VCG2P5_S                                          8

// Field:   [7:0] VINH
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_VHV_PV_VINH_W                                            8
#define FCFG1_FLASH_VHV_PV_VINH_M                                   0x000000FF
#define FCFG1_FLASH_VHV_PV_VINH_S                                            0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_V
//
//*****************************************************************************
// Field: [31:24] VSL_P
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_V_VSL_P_W                                                8
#define FCFG1_FLASH_V_VSL_P_M                                       0xFF000000
#define FCFG1_FLASH_V_VSL_P_S                                               24

// Field: [23:16] VWL_P
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_V_VWL_P_W                                                8
#define FCFG1_FLASH_V_VWL_P_M                                       0x00FF0000
#define FCFG1_FLASH_V_VWL_P_S                                               16

// Field:  [15:8] V_READ
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_V_V_READ_W                                               8
#define FCFG1_FLASH_V_V_READ_M                                      0x0000FF00
#define FCFG1_FLASH_V_V_READ_S                                               8

//*****************************************************************************
//
// Register: FCFG1_O_USER_ID
//
//*****************************************************************************
// Field: [31:28] PG_REV
//
// Field used to distinguish revisions of the device.
#define FCFG1_USER_ID_PG_REV_W                                               4
#define FCFG1_USER_ID_PG_REV_M                                      0xF0000000
#define FCFG1_USER_ID_PG_REV_S                                              28

// Field: [27:26] VER
//
// Version number.
//
// 0x0: Bits [25:12] of this register has the stated meaning.
//
// Any other setting indicate a different encoding of these bits.
#define FCFG1_USER_ID_VER_W                                                  2
#define FCFG1_USER_ID_VER_M                                         0x0C000000
#define FCFG1_USER_ID_VER_S                                                 26

// Field: [22:19] SEQUENCE
//
// Sequence.
//
// Used to differentiate between marketing/orderable product where other fields
// of USER_ID is the same (temp range, flash size, voltage range etc)
#define FCFG1_USER_ID_SEQUENCE_W                                             4
#define FCFG1_USER_ID_SEQUENCE_M                                    0x00780000
#define FCFG1_USER_ID_SEQUENCE_S                                            19

// Field: [18:16] PKG
//
// Package type.
//
// 0x0: 4x4mm QFN (RHB) package
// 0x1: 5x5mm QFN (RSM) package
// 0x2: 7x7mm QFN (RGZ) package
// 0x3: Wafer sale package (naked die)
// 0x4: 2.7x2.7mm WCSP (YFV)
// 0x5: 7x7mm QFN package with Wettable Flanks
//
// Other values are reserved for future use.
// Packages available for a specific device are shown in the device datasheet.
#define FCFG1_USER_ID_PKG_W                                                  3
#define FCFG1_USER_ID_PKG_M                                         0x00070000
#define FCFG1_USER_ID_PKG_S                                                 16

// Field: [15:12] PROTOCOL
//
// Protocols supported.
//
// 0x1: BLE
// 0x2: RF4CE
// 0x4: Zigbee/6lowpan
// 0x8: Proprietary
//
// More than one protocol can be supported on same device - values above are
// then combined.
#define FCFG1_USER_ID_PROTOCOL_W                                             4
#define FCFG1_USER_ID_PROTOCOL_M                                    0x0000F000
#define FCFG1_USER_ID_PROTOCOL_S                                            12

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_OTP_DATA3
//
//*****************************************************************************
// Field: [31:23] EC_STEP_SIZE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_W                                 9
#define FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_M                        0xFF800000
#define FCFG1_FLASH_OTP_DATA3_EC_STEP_SIZE_S                                23

// Field:    [22] DO_PRECOND
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND                            0x00400000
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND_BITN                               22
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND_M                          0x00400000
#define FCFG1_FLASH_OTP_DATA3_DO_PRECOND_S                                  22

// Field: [21:18] MAX_EC_LEVEL
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_W                                 4
#define FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_M                        0x003C0000
#define FCFG1_FLASH_OTP_DATA3_MAX_EC_LEVEL_S                                18

// Field: [17:16] TRIM_1P7
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_OTP_DATA3_TRIM_1P7_W                                     2
#define FCFG1_FLASH_OTP_DATA3_TRIM_1P7_M                            0x00030000
#define FCFG1_FLASH_OTP_DATA3_TRIM_1P7_S                                    16

// Field:  [15:8] FLASH_SIZE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_W                                   8
#define FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_M                          0x0000FF00
#define FCFG1_FLASH_OTP_DATA3_FLASH_SIZE_S                                   8

