RIOT-OS/RIOT/cpu/cc26xx_cc13xx/vendor/ti/devices/cc13x0/inc/hw_fcfg1.h
// Field:   [7:0] WAIT_SYSCODE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_W                                 8
#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_M                        0x000000FF
#define FCFG1_FLASH_OTP_DATA3_WAIT_SYSCODE_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_ANA2_TRIM
//
//*****************************************************************************
// Field:    [31] RCOSCHFCTRIMFRACT_EN
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN                        0x80000000
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN_BITN                           31
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN_M                      0x80000000
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN_S                              31

// Field: [30:26] RCOSCHFCTRIMFRACT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_W                                  5
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_M                         0x7C000000
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_S                                 26

// Field: [24:23] SET_RCOSC_HF_FINE_RESISTOR
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_W                         2
#define FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_M                0x01800000
#define FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_S                        23

// Field:    [22] ATESTLF_UDIGLDO_IBIAS_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM                  0x00400000
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM_BITN                     22
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM_M                0x00400000
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM_S                        22

// Field: [21:16] NANOAMP_RES_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_W                                   6
#define FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_M                          0x003F0000
#define FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_S                                  16

// Field:    [11] DITHER_EN
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_DITHER_EN                                   0x00000800
#define FCFG1_ANA2_TRIM_DITHER_EN_BITN                                      11
#define FCFG1_ANA2_TRIM_DITHER_EN_M                                 0x00000800
#define FCFG1_ANA2_TRIM_DITHER_EN_S                                         11

// Field:  [10:8] DCDC_IPEAK
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_DCDC_IPEAK_W                                         3
#define FCFG1_ANA2_TRIM_DCDC_IPEAK_M                                0x00000700
#define FCFG1_ANA2_TRIM_DCDC_IPEAK_S                                         8

// Field:   [7:6] DEAD_TIME_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_W                                     2
#define FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_M                            0x000000C0
#define FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_S                                     6

// Field:   [5:3] DCDC_LOW_EN_SEL
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_W                                    3
#define FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_M                           0x00000038
#define FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_S                                    3

// Field:   [2:0] DCDC_HIGH_EN_SEL
//
// Internal. Only to be used through TI provided API.
#define FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_W                                   3
#define FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_M                          0x00000007
#define FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_S                                   0

//*****************************************************************************
//
// Register: FCFG1_O_LDO_TRIM
//
//*****************************************************************************
// Field: [28:24] VDDR_TRIM_SLEEP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_W                                     5
#define FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_M                            0x1F000000
#define FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_S                                    24

// Field: [18:16] GLDO_CURSRC
//
// Internal. Only to be used through TI provided API.
#define FCFG1_LDO_TRIM_GLDO_CURSRC_W                                         3
#define FCFG1_LDO_TRIM_GLDO_CURSRC_M                                0x00070000
#define FCFG1_LDO_TRIM_GLDO_CURSRC_S                                        16

// Field: [12:11] ITRIM_DIGLDO_LOAD
//
// Internal. Only to be used through TI provided API.
#define FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_W                                   2
#define FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_M                          0x00001800
#define FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_S                                  11

// Field:  [10:8] ITRIM_UDIGLDO
//
// Internal. Only to be used through TI provided API.
#define FCFG1_LDO_TRIM_ITRIM_UDIGLDO_W                                       3
#define FCFG1_LDO_TRIM_ITRIM_UDIGLDO_M                              0x00000700
#define FCFG1_LDO_TRIM_ITRIM_UDIGLDO_S                                       8

// Field:   [2:0] VTRIM_DELTA
//
// Internal. Only to be used through TI provided API.
#define FCFG1_LDO_TRIM_VTRIM_DELTA_W                                         3
#define FCFG1_LDO_TRIM_VTRIM_DELTA_M                                0x00000007
#define FCFG1_LDO_TRIM_VTRIM_DELTA_S                                         0

//*****************************************************************************
//
// Register: FCFG1_O_BAT_RC_LDO_TRIM
//
//*****************************************************************************
// Field: [27:24] VTRIM_BOD
//
// Internal. Only to be used through TI provided API.
#define FCFG1_BAT_RC_LDO_TRIM_VTRIM_BOD_W                                    4
#define FCFG1_BAT_RC_LDO_TRIM_VTRIM_BOD_M                           0x0F000000
#define FCFG1_BAT_RC_LDO_TRIM_VTRIM_BOD_S                                   24

// Field: [19:16] VTRIM_UDIG
//
// Internal. Only to be used through TI provided API.
#define FCFG1_BAT_RC_LDO_TRIM_VTRIM_UDIG_W                                   4
#define FCFG1_BAT_RC_LDO_TRIM_VTRIM_UDIG_M                          0x000F0000
#define FCFG1_BAT_RC_LDO_TRIM_VTRIM_UDIG_S                                  16

// Field:  [11:8] RCOSCHF_ITUNE_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_BAT_RC_LDO_TRIM_RCOSCHF_ITUNE_TRIM_W                           4
#define FCFG1_BAT_RC_LDO_TRIM_RCOSCHF_ITUNE_TRIM_M                  0x00000F00
#define FCFG1_BAT_RC_LDO_TRIM_RCOSCHF_ITUNE_TRIM_S                           8

// Field:   [1:0] MEASUREPER
//
// Internal. Only to be used through TI provided API.
#define FCFG1_BAT_RC_LDO_TRIM_MEASUREPER_W                                   2
#define FCFG1_BAT_RC_LDO_TRIM_MEASUREPER_M                          0x00000003
#define FCFG1_BAT_RC_LDO_TRIM_MEASUREPER_S                                   0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_BLE_0
//
//*****************************************************************************
// Field:  [31:0] ADDR_0_31
//
// The first 32-bits of the 64-bit MAC BLE address
#define FCFG1_MAC_BLE_0_ADDR_0_31_W                                         32
#define FCFG1_MAC_BLE_0_ADDR_0_31_M                                 0xFFFFFFFF
#define FCFG1_MAC_BLE_0_ADDR_0_31_S                                          0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_BLE_1
//
//*****************************************************************************
// Field:  [31:0] ADDR_32_63
//
// The last 32-bits of the 64-bit MAC BLE address
#define FCFG1_MAC_BLE_1_ADDR_32_63_W                                        32
#define FCFG1_MAC_BLE_1_ADDR_32_63_M                                0xFFFFFFFF
#define FCFG1_MAC_BLE_1_ADDR_32_63_S                                         0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_15_4_0
//
//*****************************************************************************
// Field:  [31:0] ADDR_0_31
//
// The first 32-bits of the 64-bit MAC 15.4 address
#define FCFG1_MAC_15_4_0_ADDR_0_31_W                                        32
#define FCFG1_MAC_15_4_0_ADDR_0_31_M                                0xFFFFFFFF
#define FCFG1_MAC_15_4_0_ADDR_0_31_S                                         0

//*****************************************************************************
//
// Register: FCFG1_O_MAC_15_4_1
//
//*****************************************************************************
// Field:  [31:0] ADDR_32_63
//
// The last 32-bits of the 64-bit MAC 15.4 address
#define FCFG1_MAC_15_4_1_ADDR_32_63_W                                       32
#define FCFG1_MAC_15_4_1_ADDR_32_63_M                               0xFFFFFFFF
#define FCFG1_MAC_15_4_1_ADDR_32_63_S                                        0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_OTP_DATA4
//
//*****************************************************************************
// Field:    [31] STANDBY_MODE_SEL_INT_WRT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT              0x80000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_BITN                 31
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_M            0x80000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT_S                    31

// Field: [30:29] STANDBY_PW_SEL_INT_WRT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_W                       2
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_M              0x60000000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_S                      29

